zeromem0/solar_os/include/boards/waveshare_esp32_s3_touch_lcd_5.h
#pragma once

#include "driver/gpio.h"
#include "driver/i2c_types.h"
#include "driver/uart.h"
#include "solar_os_expansion_types.h"

#define SOLAR_OS_BOARD_ID "waveshare_esp32_s3_touch_lcd_5"
#define SOLAR_OS_BOARD_NAME "Waveshare ESP32-S3-Touch-LCD-5"
#define SOLAR_OS_BOARD_VENDOR "Waveshare"
#define SOLAR_OS_BOARD_MODULE_NAME "ESP32-S3-WROOM-1-N16R8"

/* No expansion GPIO pins exposed yet -- this is still a minimal port
 * (no buttons/joystick/dpad, no expansion I2C/SPI/UART/ADC/PWM). */
#define SOLAR_OS_BOARD_EXPANSION_GPIO_LIST ""
#define SOLAR_OS_BOARD_USER_GPIO_LIST ""

/*
 * solar_os_ble_keyboard_init() hangs boot indefinitely on this board
 * (confirmed via a clean serial capture that stops dead partway
 * through BLE bring-up, well past its own internal 5s timeout, on
 * every boot -- root cause not yet found). The capability bit above
 * stays set because plenty of shared shell code calls
 * solar_os_ble_keyboard_* functions unconditionally regardless of it;
 * those are all safe no-ops when the service was never initialized.
 * This just stops main.c from making the one call that hangs.
 */
#define SOLAR_OS_BOARD_BLE_KEYBOARD_SKIP_INIT 1

/*
 * 800x480 RGB-parallel panel (ST7262 controller, no command interface --
 * "simple RGB", so there's no SPI/I2C init sequence to send, just the
 * timing below plus reset/backlight through the CH422G expander).
 * Values below are Waveshare's own reference config for this exact
 * SKU (28117), from esp-arduino-libs/ESP32_Display_Panel's
 * BOARD_WAVESHARE_ESP32_S3_TOUCH_LCD_5.h -- not re-derived/guessed.
 */
#define SOLAR_OS_BOARD_DISPLAY_CONTROLLER "ST7262"
#define SOLAR_OS_BOARD_DISPLAY_WIDTH 800
#define SOLAR_OS_BOARD_DISPLAY_HEIGHT 480

/* Panel datasheet typical is 16MHz (240/15). 15MHz (240/16) trades a
 * bit of refresh rate (~56Hz) for PSRAM-bus headroom for the bounce
 * refill ISR while apps repaint. Keep this an INTEGER divisor of the
 * 240MHz source: a fractional divider (e.g. 14MHz) produces an
 * unstable pixel clock on the S3 and hung the boot outright. */
#define SOLAR_OS_BOARD_DISPLAY_RGB_PCLK_HZ (15 * 1000 * 1000)
#define SOLAR_OS_BOARD_DISPLAY_RGB_HSYNC_PULSE 4
#define SOLAR_OS_BOARD_DISPLAY_RGB_HSYNC_BACK_PORCH 8
#define SOLAR_OS_BOARD_DISPLAY_RGB_HSYNC_FRONT_PORCH 8
#define SOLAR_OS_BOARD_DISPLAY_RGB_VSYNC_PULSE 4
#define SOLAR_OS_BOARD_DISPLAY_RGB_VSYNC_BACK_PORCH 8
#define SOLAR_OS_BOARD_DISPLAY_RGB_VSYNC_FRONT_PORCH 8
#define SOLAR_OS_BOARD_DISPLAY_RGB_PCLK_ACTIVE_NEG 1
#define SOLAR_OS_BOARD_DISPLAY_RGB_DISP_ACTIVE_LEVEL 1

#define SOLAR_OS_BOARD_PIN_LCD_RGB_HSYNC GPIO_NUM_46
#define SOLAR_OS_BOARD_PIN_LCD_RGB_VSYNC GPIO_NUM_3
#define SOLAR_OS_BOARD_PIN_LCD_RGB_DE GPIO_NUM_5
#define SOLAR_OS_BOARD_PIN_LCD_RGB_PCLK GPIO_NUM_7

/* RGB565 over 16 data lines: B0-4, G0-5, R0-4. */
#define SOLAR_OS_BOARD_PIN_LCD_RGB_DATA0 GPIO_NUM_14  /* B0 */
#define SOLAR_OS_BOARD_PIN_LCD_RGB_DATA1 GPIO_NUM_38  /* B1 */
#define SOLAR_OS_BOARD_PIN_LCD_RGB_DATA2 GPIO_NUM_18  /* B2 */
#define SOLAR_OS_BOARD_PIN_LCD_RGB_DATA3 GPIO_NUM_17  /* B3 */
#define SOLAR_OS_BOARD_PIN_LCD_RGB_DATA4 GPIO_NUM_10  /* B4 */
#define SOLAR_OS_BOARD_PIN_LCD_RGB_DATA5 GPIO_NUM_39  /* G0 */
#define SOLAR_OS_BOARD_PIN_LCD_RGB_DATA6 GPIO_NUM_0   /* G1 */
#define SOLAR_OS_BOARD_PIN_LCD_RGB_DATA7 GPIO_NUM_45  /* G2 */
#define SOLAR_OS_BOARD_PIN_LCD_RGB_DATA8 GPIO_NUM_48  /* G3 */
#define SOLAR_OS_BOARD_PIN_LCD_RGB_DATA9 GPIO_NUM_47  /* G4 */
#define SOLAR_OS_BOARD_PIN_LCD_RGB_DATA10 GPIO_NUM_21 /* G5 */
#define SOLAR_OS_BOARD_PIN_LCD_RGB_DATA11 GPIO_NUM_1  /* R0 */
#define SOLAR_OS_BOARD_PIN_LCD_RGB_DATA12 GPIO_NUM_2  /* R1 */
#define SOLAR_OS_BOARD_PIN_LCD_RGB_DATA13 GPIO_NUM_42 /* R2 */
#define SOLAR_OS_BOARD_PIN_LCD_RGB_DATA14 GPIO_NUM_41 /* R3 */
#define SOLAR_OS_BOARD_PIN_LCD_RGB_DATA15 GPIO_NUM_40 /* R4 */

/*
 * CH422G IO expander pin indices (its 8 push-pull GPIOs, IO0-IO7 --
 * not raw ESP32 GPIO numbers). Confirmed from Waveshare's docs and the
 * same ESP32_Display_Panel board config: TP_RST=1, DISP(backlight)=2,
 * LCD_RST=3, SD_CS=4. DI0/DI1 (0/5) are inputs Waveshare reserves for
 * future use and aren't driven by this port.
 */
#define SOLAR_OS_BOARD_CH422G_PIN_TP_RST 1
#define SOLAR_OS_BOARD_CH422G_PIN_BACKLIGHT 2
#define SOLAR_OS_BOARD_CH422G_PIN_LCD_RST 3
#define SOLAR_OS_BOARD_CH422G_PIN_SD_CS 4

/*
 * Internal I2C bus: CH422G expander, GT911 touch (not driven by this
 * port yet) and PCF85063 RTC all share this bus.
 */
#define SOLAR_OS_BOARD_I2C_PORT I2C_NUM_0
#define SOLAR_OS_BOARD_PIN_I2C_SDA GPIO_NUM_8
#define SOLAR_OS_BOARD_PIN_I2C_SCL GPIO_NUM_9

/*
 * Dedicated SPI bus for the SD card only (the display doesn't use SPI
 * at all -- it's RGB parallel). CS is driven through the CH422G
 * expander rather than a raw GPIO (see lcd_rgb_panel.c, which asserts
 * it once at display-init time), so SOLAR_OS_BOARD_PIN_SD_CARD_CS is
 * GPIO_NUM_NC and the SPI driver never toggles hardware CS itself.
 *
 * UNVERIFIED: Waveshare's docs only give "SD Card: SPI on GPIO11-13"
 * without saying which pin is which signal. This SCLK/MOSI/MISO
 * assignment is a best guess pending confirmation on real hardware --
 * check against the schematic PDF or a continuity meter if the card
 * doesn't mount.
 */
#define SOLAR_OS_BOARD_SPI_HOST SPI2_HOST
#define SOLAR_OS_BOARD_SPI_NAME "SD_SPI"
#define SOLAR_OS_BOARD_PIN_SPI_SCLK GPIO_NUM_12
#define SOLAR_OS_BOARD_PIN_SPI_MOSI GPIO_NUM_11
#define SOLAR_OS_BOARD_PIN_SPI_MISO GPIO_NUM_13
#define SOLAR_OS_BOARD_SPI_MAX_TRANSFER_SZ 4096
#define SOLAR_OS_BOARD_PIN_SD_CARD_CS GPIO_NUM_NC

/*
 * UART lives on GPIO15/16 -- the board's stock CAN pins (TJA1051
 * TXD/RXD). Confirmed from the schematic: GPIO15=CANTX, GPIO16=CANRX.
 * ESP32-S3 UART controllers are fully GPIO-matrix routable, so this
 * works in software regardless of pin choice, but electrically these
 * only become a genuine point-to-point serial port once the TJA1051
 * is swapped for a MAX232 (or similar) on the hardware side -- until
 * then, whatever's driven here still passes through the CAN
 * transceiver as originally wired. Swapping the transceiver trades
 * away CAN support for a real UART/RS232 port. UART_NUM_1 is used
 * (not 0) purely to keep clear of any ROM/bootloader UART0 defaults;
 * nothing on this board is actually wired to UART0's pins.
 */
#define SOLAR_OS_BOARD_UART_PORT UART_NUM_1
#define SOLAR_OS_BOARD_PIN_UART_TX GPIO_NUM_15
#define SOLAR_OS_BOARD_PIN_UART_RX GPIO_NUM_16
/*
 * With the stock TJA1051 still populated, its RXD output actively
 * drives GPIO16 -- and with no CAN bus attached the receiver
 * oscillates, which UART1 at 115200 decodes as a continuous stream of
 * garbage bytes. A fallback shell on that port then "executes" junk
 * lines nonstop; each executed line persists shell history to flash
 * and scans the alias file, and those constant flash commits (which
 * disable the cache on both CPUs) starve the display's PSRAM feed,
 * the USB console, and the idle task (watchdog trips). Keep the port
 * registered for deliberate use (com app, bridge), but never park an
 * autonomous shell on it until the transceiver is swapped.
 */
#define SOLAR_OS_BOARD_UART_NO_FALLBACK_SHELL 1

/*
 * Minimal port: display, RTC, SD, UART, connectivity. Not yet wired:
 * GT911 touch (SolarOS has no touch-input capability/service at all
 * yet -- follow-up work, same as Core2's touch), RS485 (SP3485 on
 * GPIO43/44, which are also the ESP32-S3's default UART0 pins --
 * SolarOS's UART service only supports one active instance at a time,
 * so RS485 would need its own follow-up work rather than just being
 * wired alongside the GPIO15/16 UART above), and BLE (see the
 * HAS_BLE comment in the board's .cmake -- boot hangs indefinitely
 * inside solar_os_ble_keyboard_init() on this board, root cause not
 * yet found). USB native CDC (GPIO19/20) is also available as a
 * console.
 */
